# Текст для обробки
text = """Італія – країна в Південній Європі, яка межує з Францією, Швейцарією, Австрією та Словенією. 
Столиця – Рим. Італія відома своєю багатою історією та архітектурною спадщиною, частина якої збереглася ще з античних часів. 
Італія є членом Європейського Союзу та НАТО. Країна відома своїм впливом на світову культуру, мистецтво, моду та кухню. 
Відомі страви італійської кухні - піца, паста та різотто. Її населення складає приблизно 60 мільйонів людей."""
# 1, 2, 3 функції зробила Завгородня Поліна

# 1. Підрахунок кількості згадувань слова "Італія"
italy_count = text.count("Італія")
print(f"Слово 'Італія' зустрічається {italy_count} разів.")

# 2. Заміна всіх згадувань "Європа" на "Середземномор'я"
new_text = text.replace("Південній Європі", "Середземномор'ї")
print("\nТекст після заміни 'Південній Європі' на 'Середземномор'ї':")
print(new_text)

# 3. Розбиття тексту на окремі речення
sentences = text.split(". ")
print("\nСписок речень у тексті:")
for sentence in sentences:
    print(f"- {sentence}")
    
# 4,5,6 функції зробив Шмат Олександр

# 4. Підрахунок кількості речень у тексті
import re

def count_sentences(text):
    sentences = re.split(r'[.!?]+', text)
    sentences = [s for s in sentences if s.strip()]

    return len(sentences)
print(f"\n4. Кількість речень у тексті: {count_sentences(text)}")

# 5. Підрахунок кількості слів у тексті
def count_words(text):
    words = text.split()
    return len(words)
word_count = count_words(text)
print(f"\n5. Кількість слів у тексті: {word_count}")

# 6. Пошук найдовшого слова у тексті
def find_longest_word(text):
    words = text.split()
    longest_word = max(words, key=len)
    return longest_word

longest_word = find_longest_word(text)
print(f"\n6. Найдовше слово у тексті: {longest_word}")

# 7, 8, 9 функції зробив (наступний має вставити сюди свою частину і вписати своє ім*я)
