# Текст для обробки
text = """Італія – країна в Південній Європі, яка межує з Францією, Швейцарією, Австрією та Словенією. 
Столиця – Рим. Італія відома своєю багатою історією та архітектурною спадщиною, частина якої збереглася ще з античних часів. 
Італія є членом Європейського Союзу та НАТО. Країна відома своїм впливом на світову культуру, мистецтво, моду та кухню. 
Відомі страви італійської кухні - піца, паста та різотто. Її населення складає приблизно 60 мільйонів людей."""
# 1, 2, 3 функції зробила Завгородня Поліна

# 1. Підрахунок кількості згадувань слова "Італія"
italy_count = text.count("Італія")
print(f"Слово 'Італія' зустрічається {italy_count} разів.")

# 2. Заміна всіх згадувань "Європа" на "Середземномор'я"
new_text = text.replace("Південній Європі", "Середземномор'ї")
print("\nТекст після заміни 'Південній Європі' на 'Середземномор'ї':")
print(new_text)

# 3. Розбиття тексту на окремі речення
sentences = text.split(". ")
print("\nСписок речень у тексті:")
for sentence in sentences:
    print(f"- {sentence}")
    
# 4, 5, 6 функції зробив (наступний має вставити сюди свою частину і вписати своє ім*я)
# 7, 8, 9 функції зробив (наступний має вставити сюди свою частину і вписати своє ім*я)
